<a href="https://colab.research.google.com/github/NileshCT/EDA_PROJECT/blob/main/GroupBy_Pandas_replace_fillna_dropna.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:

# df = pd.DataFrame({
#     "country" : ["United States", "Canada", "United Kingdom", "France", "Germany", "China", "Japan", "South Korea"],
#     "continent" : ["North America", "North America", "Europe", "Europe", "Europe", "Asia", "Asia", "Asia"],
#     "population" : [332722557, 38711108, 67081234, 67853000, 83222442, 1412600000, 125502000, 51745000],
#     "area" : [3796742, 3855100, 93628, 247368, 137882, 3705407, 145937, 38690],
#     "population percentage of world": [4.18, 0.487, 0.843, 0.853, 1.05, 17.8, 1.58, 0.650]})
# df

In [3]:

# importing pandas module
import pandas as pd

# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
				'Gaurav', 'Anuj', 'Princi', 'Abhi'],
		'Age':[27, 24, 22, 32,
			33, 36, 27, 32],
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd',
						'B.Tech', 'B.com', 'Msc', 'MA']}
	

# Convert the dictionary into DataFrame
df = pd.DataFrame(data1)

print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

# **Groupby with one key argument**

In [4]:
print(df.groupby('Name').groups)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [5]:
print(df.groupby("Age").groups)

{22: [2], 24: [1], 27: [0, 6], 32: [3, 7], 33: [4], 36: [5]}

In [6]:
print(df.groupby("Address").groups)

{'Aligarh': [7], 'Allahabad': [2, 6], 'Jaunpur': [4], 'Kannuaj': [3], 'Kanpur': [1, 5], 'Nagpur': [0]}

In [7]:
print(df.groupby("Qualification").groups)

{'B.Tech': [4], 'B.com': [5], 'MA': [1, 7], 'MCA': [2], 'Msc': [0, 6], 'Phd': [3]}

**GroupBy with 1 key and print first entries.**

In [8]:
gk=df.groupby("Name")
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [9]:
gk=df.groupby("Name")
gk.last()

        Age    Address Qualification
Name
Abhi     32    Aligarh            MA
Anuj     36     Kanpur         B.com
Gaurav   33    Jaunpur        B.Tech
Jai      22  Allahabad           MCA
Princi   27  Allahabad           Msc

In [10]:
gk=df.groupby("Name")
gk.sample()

     Name  Age  Address Qualification
7    Abhi   32  Aligarh            MA
5    Anuj   36   Kanpur         B.com
4  Gaurav   33  Jaunpur        B.Tech
0     Jai   27   Nagpur           Msc
3  Princi   32  Kannuaj           Phd

In [11]:
gk=df.groupby(["Name","Qualification"])
print(gk.groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [12]:
gk=df.groupby(["Name","Age"])
print(gk.groups)

{('Abhi', 32): [7], ('Anuj', 24): [1], ('Anuj', 36): [5], ('Gaurav', 33): [4], ('Jai', 22): [2], ('Jai', 27): [0], ('Princi', 27): [6], ('Princi', 32): [3]}

In [13]:
# importing pandas module
import pandas as pd

# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
				'Gaurav', 'Anuj', 'Princi', 'Abhi'],
		'Age':[27, 24, 22, 32,
			33, 36, 27, 32],
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd',
						'B.Tech', 'B.com', 'Msc', 'MA']}
	

# Convert the dictionary into DataFrame
df = pd.DataFrame(data1)

print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [14]:
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [15]:
df.groupby(["Age"])["Name"].sum()

Age
22           Jai
24          Anuj
27     JaiPrinci
32    PrinciAbhi
33        Gaurav
36          Anuj
Name: Name, dtype: object

In [16]:
gk=df.groupby(["Name","Age"]).sum()
gk

              Address Qualification
Name   Age
Abhi   32     Aligarh            MA
Anuj   24      Kanpur            MA
       36      Kanpur         B.com
Gaurav 33     Jaunpur        B.Tech
Jai    22   Allahabad           MCA
       27      Nagpur           Msc
Princi 27   Allahabad           Msc
       32     Kannuaj           Phd

In [17]:
df.groupby(["Name"])["Qualification"].count()

Name
Abhi      1
Anuj      2
Gaurav    1
Jai       2
Princi    2
Name: Qualification, dtype: int64

In [18]:
df['Age'] = pd.to_numeric(df['Age'])

In [19]:
df.describe()

             Age
count   8.000000
mean   29.125000
std     4.853202
min    22.000000
25%    26.250000
50%    29.500000
75%    32.250000
max    36.000000

In [20]:
df.groupby(["Name"])["Age"].mean()

Name
Abhi      32.0
Anuj      30.0
Gaurav    33.0
Jai       24.5
Princi    29.5
Name: Age, dtype: float64

In [21]:
df

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [22]:
df.groupby(["Name"])["Age"].max()

Name
Abhi      32
Anuj      36
Gaurav    33
Jai       27
Princi    32
Name: Age, dtype: int64

In [23]:
df.head()

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech

In [24]:
df1=df.copy()

In [25]:
# importing pandas module
import pandas as pd

# Define a dictionary containing employee data
data1 = {'Name':['Jai', '', 'Jai', '',
				'Gaurav', 'Anuj', 'Princi', 'Abhi'],
		'Age':[27,'',22, 32,
			33, 36,"",32],
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd',
						'B.Tech', 'B.com', 'Msc', 'MA']}
	

# Convert the dictionary into DataFrame
df1= pd.DataFrame(data1)

print(df1)

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech
5    Anuj  36     Kanpur         B.com
6  Princi      Allahabad           Msc
7    Abhi  32    Aligarh            MA

In [26]:
df.groupby(["Name"])["Age"].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [27]:
df.groupby(["Address"])
print(df.groupby(["Address"]).groups)

{'Aligarh': [7], 'Allahabad': [2, 6], 'Jaunpur': [4], 'Kannuaj': [3], 'Kanpur': [1, 5], 'Nagpur': [0]}

In [28]:
print(df.groupby(["Age"]).groups)

{22: [2], 24: [1], 27: [0, 6], 32: [3, 7], 33: [4], 36: [5]}

In [29]:
df.groupby('Name').mean().add_prefix("mean_")

<ipython-input-29-402ca8ef2cf2>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Name').mean().add_prefix("mean_")

        mean_Age
Name
Abhi        32.0
Anuj        30.0
Gaurav      33.0
Jai         24.5
Princi      29.5

In [30]:
df.groupby("Name")["Age"].mean()

Name
Abhi      32.0
Anuj      30.0
Gaurav    33.0
Jai       24.5
Princi    29.5
Name: Age, dtype: float64

In [31]:
df.groupby(["Name"])["Age"].agg(["min","max","mean","count","std"])

        min  max  mean  count       std
Name
Abhi     32   32  32.0      1       NaN
Anuj     24   36  30.0      2  8.485281
Gaurav   33   33  33.0      1       NaN
Jai      22   27  24.5      2  3.535534
Princi   27   32  29.5      2  3.535534

In [32]:
df.groupby(["Name"]).agg({"Age":"mean"})

         Age
Name
Abhi    32.0
Anuj    30.0
Gaurav  33.0
Jai     24.5
Princi  29.5

In [33]:
df1.dropna()

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech
5    Anuj  36     Kanpur         B.com
6  Princi      Allahabad           Msc
7    Abhi  32    Aligarh            MA

In [34]:
df1.head()

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech

In [35]:
df1.dropna(axis=1)

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech
5    Anuj  36     Kanpur         B.com
6  Princi      Allahabad           Msc
7    Abhi  32    Aligarh            MA

In [36]:
df1.head()

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech

In [37]:
df.groupby("Name").mean()

<ipython-input-37-9a689ccf7294>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Name").mean()

         Age
Name
Abhi    32.0
Anuj    30.0
Gaurav  33.0
Jai     24.5
Princi  29.5

In [38]:
df1

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech
5    Anuj  36     Kanpur         B.com
6  Princi      Allahabad           Msc
7    Abhi  32    Aligarh            MA

In [39]:
df1.fillna("Name")

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai  22  Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech
5    Anuj  36     Kanpur         B.com
6  Princi      Allahabad           Msc
7    Abhi  32    Aligarh            MA

In [40]:
df1["Age"]=df["Age"].fillna(100)
df1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1           24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3           32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [41]:
df1["Name"]=df["Name"].fillna("Nil")
df1.head()

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech

In [42]:
#Replace method(df2)

In [43]:
df2=df.copy()

In [44]:
#replaceing null values with no name with replace method
df2["Name"].replace("","no value",inplace=True)

In [45]:
import numpy as np
from scipy import stats

In [46]:
#mode value 
mode1 = stats.mode(df2["Name"])
print(mode1[0][0])

Jai

<ipython-input-46-f935e4bb530d>:2: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  mode1 = stats.mode(df2["Name"])
<ipython-input-46-f935e4bb530d>:2: DeprecationWarning: Support for non-numeric arrays has been deprecated as of SciPy 1.9.0 and will be removed in 1.11.0. `pandas.DataFrame.mode` can be used instead, see https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.mode.html.
  mode1 = stats.mode(df2["Name"])

In [47]:
# ##replaceing null values with modal value with replace method.
# df2["Name"].replace('no value',np.mode(df2['Name']))
df2["Name"].replace("no value",str(mode1[0][0]))

0       Jai
1      Anuj
2       Jai
3    Princi
4    Gaurav
5      Anuj
6    Princi
7      Abhi
Name: Name, dtype: object

In [48]:
df2["Name"]

0       Jai
1      Anuj
2       Jai
3    Princi
4    Gaurav
5      Anuj
6    Princi
7      Abhi
Name: Name, dtype: object

In [49]:
#fillna method(df3)

In [50]:
df3=df.copy()

In [51]:
print(df3)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [52]:
df3.replace("",np.nan,inplace=True)

In [53]:
df3["Age"].fillna(np.mean(df3["Age"]))

0    27
1    24
2    22
3    32
4    33
5    36
6    27
7    32
Name: Age, dtype: int64

In [54]:
# importing pandas module
import pandas as pd

# Define a dictionary containing employee data
data1 = {'Name':['Jai', '', 'Jai', '',
				'Gaurav', 'Anuj', 'Princi', 'Abhi'],
		'Age':[27,'','', 32,
			33, 36,12,32],
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd',
						'B.Tech', 'B.com', 'Msc', 'MA']}
	

# Convert the dictionary into DataFrame
df = pd.DataFrame(data1)

print(df)

     Name Age    Address Qualification
0     Jai  27     Nagpur           Msc
1                 Kanpur            MA
2     Jai      Allahabad           MCA
3          32    Kannuaj           Phd
4  Gaurav  33    Jaunpur        B.Tech
5    Anuj  36     Kanpur         B.com
6  Princi  12  Allahabad           Msc
7    Abhi  32    Aligarh            MA

In [55]:
#for both b and f fill
df4=df.copy()

In [56]:
df4["Age"].replace('',np.nan,inplace=True)
df4["Age"]
data=df4.bfill().ffill()
data

     Name   Age    Address Qualification
0     Jai  27.0     Nagpur           Msc
1          32.0     Kanpur            MA
2     Jai  32.0  Allahabad           MCA
3          32.0    Kannuaj           Phd
4  Gaurav  33.0    Jaunpur        B.Tech
5    Anuj  36.0     Kanpur         B.com
6  Princi  12.0  Allahabad           Msc
7    Abhi  32.0    Aligarh            MA

In [57]:
df.groupby(["Name"])["Age"].mean()

TypeError: ignored

In [ ]:
df.info()

# **Fillna()**

In [ ]:
# importing pandas module
import pandas as pd

# Define a dictionary containing employee data
data1 = {'Name':['Jai',np.nan, 'Jai', 'Princi',
				'Gaurav', 'Anuj', 'Princi',np.nan],
		'Age':[27, 24, 22,np.nan,
			33, 36,np.nan, 32],
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
				'Jaunpur',np.nan, 'Allahabad',np.nan],
		'marks':[np.nan,98,57,100,
						90,45,34,85]}
	

# Convert the dictionary into DataFrame
df6 = pd.DataFrame(data1)

print(df6)

In [ ]:
df6["Name"].fillna("Nil")

In [ ]:
df6["Age"].fillna(df6["Age"].max())

In [ ]:
df6.fillna({"Age":0,"marks":101})

In [ ]:
df6["marks"].fillna(method="bfill")

In [ ]:
df6.fillna(method='pad')

In [ ]:
df6

In [ ]:
df6["Name"].fillna("no values")

In [ ]:
df6.fillna(1)

In [ ]:
df6.replace(to_replace=np.nan,value=1)

In [ ]:
df6["Age"].fillna(np.mean(df6["Age"]))

# **Dropna()**

In [ ]:
df6.dropna()

In [ ]:
df6.dropna(axis=1)

In [ ]:
df6.dropna(how='all')

In [58]:
import pandas as pd
import numpy as np

In [67]:
df1=pd.read_csv("/content/drive/MyDrive/sales.csv")

In [68]:
df1.head()

        date  gender      region  sales
0  8/22/2022    Male  North-West  20381
1   3/5/2022    Male  North-East  14495
2   2/9/2022    Male  North-East  13510
3  6/22/2022    Male  North-East  15983
4  8/10/2022  Female  North-West  15007

In [103]:
print(df.groupby("gender")["sales"].count())

gender
Female    505
Male      495
Name: sales, dtype: int64

In [102]:
print(df.groupby("gender")["sales"].mean())

gender
Female    19094.493069
Male      18993.474747
Name: sales, dtype: float64

In [101]:
print(df.groupby("region")["sales"].median())

region
North-East    17414.0
North-West    15337.5
South         24492.0
Name: sales, dtype: float64

In [99]:
print(df.groupby("region")["sales"].std())

region
North-East    2032.541552
North-West    3621.456493
South         5253.702513
Name: sales, dtype: float64

In [98]:
print(df.groupby("region")["sales"].count())

region
North-East    347
North-West    322
South         331
Name: sales, dtype: int64

In [97]:
print(df.groupby("region")["sales"].mean())

region
North-East    17386.072046
North-West    15257.732919
South         24466.864048
Name: sales, dtype: float64

In [95]:
print(df.groupby("gender").get_group("Female"))

           date  gender      region  sales
4     8/10/2022  Female  North-West  15007
9     1/16/2022  Female       South  24114
11    4/30/2022  Female  North-West  19631
12   11/25/2022  Female  North-East  18262
13    8/14/2022  Female  North-East  13733
..          ...     ...         ...    ...
989  10/14/2022  Female  North-West  15319
990    7/7/2022  Female  North-East  16468
995    6/2/2022  Female  North-West  14015
996   5/20/2022  Female  North-East  15503
999  12/19/2022  Female  North-West  16589

[505 rows x 4 columns]

In [94]:
print(df.groupby("gender").get_group("Male"))

          date gender      region  sales
0    8/22/2022   Male  North-West  20381
1     3/5/2022   Male  North-East  14495
2     2/9/2022   Male  North-East  13510
3    6/22/2022   Male  North-East  15983
5     9/6/2022   Male       South  21792
..         ...    ...         ...    ...
992   1/5/2022   Male  North-East  17441
993  6/11/2022   Male  North-West  14942
994  9/29/2022   Male       South  21255
997   4/2/2022   Male  North-East  18714
998  12/7/2022   Male  North-East  19910

[495 rows x 4 columns]

In [93]:
print(df.groupby("region").get_group("North-West"))

           date  gender      region  sales
0     8/22/2022    Male  North-West  20381
4     8/10/2022  Female  North-West  15007
7      7/8/2022    Male  North-West  13650
11    4/30/2022  Female  North-West  19631
16    4/18/2022    Male  North-West  17397
..          ...     ...         ...    ...
988   7/10/2022    Male  North-West  12500
989  10/14/2022  Female  North-West  15319
993   6/11/2022    Male  North-West  14942
995    6/2/2022  Female  North-West  14015
999  12/19/2022  Female  North-West  16589

[322 rows x 4 columns]

In [92]:
print(df.groupby("region").get_group("North-West"))

           date  gender      region  sales
0     8/22/2022    Male  North-West  20381
4     8/10/2022  Female  North-West  15007
7      7/8/2022    Male  North-West  13650
11    4/30/2022  Female  North-West  19631
16    4/18/2022    Male  North-West  17397
..          ...     ...         ...    ...
988   7/10/2022    Male  North-West  12500
989  10/14/2022  Female  North-West  15319
993   6/11/2022    Male  North-West  14942
995    6/2/2022  Female  North-West  14015
999  12/19/2022  Female  North-West  16589

[322 rows x 4 columns]

In [91]:
print(df.groupby("region").get_group("South"))

           date  gender region  sales
5      9/6/2022    Male  South  21792
6     8/21/2022    Male  South  20113
8    11/22/2022    Male  South  14594
9     1/16/2022  Female  South  24114
10   12/21/2022    Male  South  35154
..          ...     ...    ...    ...
972    6/9/2022    Male  South  22254
979  11/24/2022  Female  South  25591
981   12/5/2022    Male  South  34334
985   12/1/2022  Female  South  21282
994   9/29/2022    Male  South  21255

[331 rows x 4 columns]

In [89]:
print(df.groupby("date").count())

           gender  region  sales
date
1/10/2022       3       3      3
1/11/2022       3       3      3
1/12/2022       2       2      2
1/13/2022       4       4      4
1/15/2022       5       5      5
...           ...     ...    ...
9/5/2022        5       5      5
9/6/2022        2       2      2
9/7/2022        3       3      3
9/8/2022        2       2      2
9/9/2022        2       2      2

[343 rows x 3 columns]

In [86]:
print(df.groupby("gender").groups.keys())

dict_keys(['Female', 'Male'])

In [85]:
print(df.groupby("region").groups.keys())

dict_keys(['North-East', 'North-West', 'South'])

In [84]:
print(df.groupby("region")["sales"].sum())

region
North-East    6032967
North-West    4912990
South         8098532
Name: sales, dtype: int64

In [80]:
print(df.groupby("region").ngroups)

3

In [71]:
print(df1.groupby(["region"]))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f31f7898c40>

In [75]:
print(df.groupby("region").groups)

{'North-East': [1, 2, 3, 12, 13, 14, 15, 18, 19, 23, 24, 25, 26, 28, 31, 35, 40, 41, 45, 50, 51, 58, 59, 60, 63, 64, 67, 68, 72, 75, 76, 77, 80, 82, 83, 85, 87, 92, 94, 100, 105, 108, 109, 112, 113, 114, 115, 120, 121, 125, 127, 130, 134, 138, 139, 140, 141, 142, 146, 149, 155, 157, 164, 165, 176, 177, 179, 180, 188, 191, 193, 195, 199, 201, 205, 207, 211, 216, 218, 222, 224, 228, 231, 236, 242, 243, 246, 249, 254, 256, 259, 264, 265, 271, 272, 280, 283, 287, 288, 289, ...], 'North-West': [0, 4, 7, 11, 16, 17, 21, 29, 30, 34, 36, 38, 39, 42, 43, 44, 46, 48, 49, 52, 55, 56, 62, 66, 70, 71, 74, 79, 88, 89, 90, 91, 95, 98, 99, 103, 106, 116, 117, 119, 122, 123, 128, 129, 132, 137, 143, 144, 147, 148, 151, 153, 154, 156, 160, 161, 169, 171, 175, 178, 184, 185, 186, 198, 204, 206, 209, 212, 217, 221, 223, 225, 230, 233, 234, 235, 237, 240, 244, 251, 252, 253, 255, 260, 261, 263, 266, 267, 277, 278, 281, 285, 290, 291, 296, 297, 300, 318, 320, 321, ...], 'South': [5, 6, 8, 9, 10, 20, 22, 27, 32, 33, 37, 47, 53, 54, 57, 61, 65, 69, 73, 78, 81, 84, 86, 93, 96, 97, 101, 102, 104, 107, 110, 111, 118, 124, 126, 131, 133, 135, 136, 145, 150, 152, 158, 159, 162, 163, 166, 167, 168, 170, 172, 173, 174, 181, 182, 183, 187, 189, 190, 192, 194, 196, 197, 200, 202, 203, 208, 210, 213, 214, 215, 219, 220, 226, 227, 229, 232, 238, 239, 241, 245, 247, 248, 250, 257, 258, 262, 268, 269, 270, 273, 274, 275, 276, 279, 282, 284, 286, 292, 294, ...]}

In [78]:
print(df.groupby("gender")["region"].count())

gender
Female    505
Male      495
Name: region, dtype: int64